#Для встановлення бібліотеки colorama виконайте команду в терміналі або командному рядку:
pip install colorama
#Після встановлення можна перевірити її наявність інтроспекцією.
# Для цього потрібно запустити інтерактивне середовище Python (python або python3) і виконати наступні команди:
import colorama
dir(colorama)
#Метод dir() виведе список всіх атрибутів і методів модуля colorama
#init(autoreset=False, strip=None, wrap=True, convert=None, **kwargs): метод для ініціалізації бібліотеки
# colorama.init() встановлює стандартні налаштування
# Якщо autoreset дорівнює True, то кольорові налаштування скидаються після кожного виведення
# strip вказує, чи видаляти кольорові налаштування з тексту
# wrap - чи переносити рядок при досягненні кінця рядка
# convert - тип конвертації кольорів
#Fore: клас з атрибутами, які дозволяють задавати кольорові налаштування для переднього плану тексту
#Back: клас з атрибутами, які дозволяють задавати кольорові налаштування для заднього плану тексту
#Style: клас з атрибутами, які дозволяють задавати стиль тексту (жирний, курсивний тощо)
#бібліотека colorama дозволяє змінювати кольори та стиль тексту, що виводиться в консоль